-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 22, 2025 at 11:23 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `milesconsultdb`
--

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `part_id` bigint(20) UNSIGNED NOT NULL,
  `aspect_id` bigint(20) UNSIGNED DEFAULT NULL,
  `sub_aspect_id` bigint(20) UNSIGNED DEFAULT NULL,
  `title` varchar(255) NOT NULL,
  `type` enum('rating','open_text','choice','multiple_choice') NOT NULL,
  `order` tinyint(3) UNSIGNED NOT NULL DEFAULT 1,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `part_id`, `aspect_id`, `sub_aspect_id`, `title`, `type`, `order`, `created_at`, `updated_at`) VALUES
(1, 1, 1, NULL, 'ผู้บริหารสามารถจัดทำแผนงานที่สอดคล้องกับวิสัยทัศน์และเป้าหมายองค์กรได้', 'rating', 1, '2025-04-11 01:42:09', '2025-07-01 12:46:41'),
(4, 1, 1, NULL, 'ผู้บริหารสามารถกำหนดกลยุทธ์และนำไปปฏิบัติในสถานการณ์ที่เปลี่ยนแปลงได้อย่างเหมาะสม', 'rating', 1, '2025-04-11 02:00:24', '2025-07-01 12:46:46'),
(5, 1, 1, NULL, 'ผู้บริหารสนับสนุนให้ทีมทำงานด้วยความทุ่มเทและมุ่งมั่นในการบรรลุเป้าหมายองค์กร', 'rating', 1, '2025-04-11 02:00:43', '2025-07-01 12:46:51'),
(6, 1, 1, NULL, 'ผู้บริหารแสดงให้เห็นถึงความสามารถในการแก้ไขปัญหาภายใต้สถานการณ์ที่มีข้อจำกัด', 'rating', 1, '2025-04-11 02:01:00', '2025-07-01 12:46:56'),
(7, 1, 2, NULL, 'ผู้บริหารสามารถออกแบบระบบหรือขั้นตอนการปฏิบัติงานที่เพิ่มประสิทธิภาพการทำงานของทีมได้อย่างแข็งแกร่ง', 'rating', 1, '2025-04-11 02:02:28', '2025-07-01 12:47:07'),
(8, 1, 2, NULL, 'ผู้บริหารส่งเสริมการทำงานที่คำนึงถึงผลกระทบต่อด้านสิ่งแวดล้อมอย่างการปรับปรุงระบบการจัดการของเสียในนิคมฯ ด้านสังคมอย่างการฝึกอบรมทักษะให้กับชุมชนรอบนิคมฯ และด้านเศรษฐกิจอย่างการวางแผนเพิ่มประสิทธิภาพการใช้พลังงานในกระบวนการผลิต เป็นต้น', 'rating', 1, '2025-04-11 02:02:48', '2025-07-01 12:47:11'),
(9, 1, 2, NULL, 'ผู้บริหารมีแนวทางการกำกับดูแลการทำงานที่ส่งเสริมความยั่งยืนในองค์กรที่ชัดเจนและเหมาะสม', 'rating', 1, '2025-04-11 02:03:03', '2025-07-01 12:47:17'),
(10, 1, 3, NULL, 'ผู้บริหารมีวิธีการบริหารจัดการสื่อสารในสถานการณ์วิกฤตเพื่อสร้างความมั่นใจในองค์กร', 'rating', 1, '2025-04-11 02:03:27', '2025-07-01 12:48:35'),
(11, 1, 3, NULL, 'ผู้บริหารสามารถใช้วิธีการสื่อสารที่เหมาะสมเพื่อสร้างความเข้าใจในกลุ่มผู้ร่วมงานที่มีความหลากหลายได้อย่างชัดเจนและเหมาะสม', 'rating', 1, '2025-04-11 02:03:42', '2025-07-01 12:48:39'),
(12, 1, 3, NULL, 'ผู้บริหารสามารถสื่อสารเชิงรุกเพื่อสนับสนุนการแก้ไขปัญหาหรือข้อขัดแย้งในทีมได้อย่างทันเวลา', 'rating', 1, '2025-04-11 02:03:57', '2025-07-01 12:48:43'),
(13, 1, 3, NULL, 'ผู้บริหารใช้ช่องทางดิจิทัลหรือสื่อออนไลน์เพื่อสร้างความเชื่อมโยงกับผู้ที่เกี่ยวข้องได้อย่างเหมาะสม', 'rating', 1, '2025-04-11 02:04:10', '2025-07-01 12:48:47'),
(14, 1, 4, NULL, 'ผู้บริหารมีแนวทางในการสร้างแรงจูงใจและพัฒนาทีมงานเพื่อบรรลุเป้าหมายองค์กรได้อย่างชัดเจน', 'rating', 1, '2025-04-11 02:04:34', '2025-07-01 12:48:54'),
(15, 1, 4, NULL, 'ผู้บริหารสนับสนุนให้ทีมเรียนรู้และทดลองนวัตกรรมใหม่ ๆ เพื่อปรับปรุงกระบวนการทำงานได้อย่างเหมาะสม', 'rating', 1, '2025-04-11 02:04:48', '2025-07-01 12:48:58'),
(16, 1, 4, NULL, 'ผู้บริหารสามารถนำข้อมูลเชิงวิเคราะห์มาใช้ในการตัดสินใจที่สำคัญขององค์กรได้เหมาะสม', 'rating', 1, '2025-04-11 02:05:10', '2025-07-01 12:49:06'),
(17, 1, 4, NULL, 'ผู้บริหารมีแนวทางในการนำเทคโนโลยีดิจิทัลมาใช้เพื่อพัฒนาการบริการและกระบวนการทำงานได้อย่างทันสมัย', 'rating', 1, '2025-04-11 02:05:27', '2025-07-01 12:49:12'),
(18, 1, 5, NULL, 'ผู้บริหารมีวิธีการกำกับดูแลให้บุคลากรปฏิบัติงานด้วยความซื่อสัตย์และโปร่งใสโดยไม่เลือกปฏิบัติ', 'rating', 1, '2025-04-11 02:24:44', '2025-07-01 12:49:26'),
(19, 1, 5, NULL, 'ผู้บริหารส่งเสริมการเคารพในความแตกต่างของผู้มีส่วนได้ส่วนเสียทั้งภายในและภายนอกองค์กร', 'rating', 1, '2025-04-11 02:25:36', '2025-07-01 12:49:31'),
(20, 1, 5, NULL, 'ผู้บริหารมีแนวทางในการสร้างวัฒนธรรมองค์กรที่เน้นความยุติธรรมและธรรมาภิบาล', 'rating', 1, '2025-04-11 02:25:54', '2025-07-01 12:49:36'),
(21, 1, 5, NULL, 'ผู้บริหารเป็นแบบอย่างของการปฏิบัติงานที่คำนึงถึงจริยธรรมและความถูกต้องในการทำงาน', 'rating', 1, '2025-04-11 02:26:10', '2025-07-01 12:49:41'),
(22, 1, 6, NULL, 'ผู้บริหารสามารถสร้างความสัมพันธ์ที่ดีและส่งเสริมการทำงานร่วมกันในทีมเพื่อบรรลุเป้าหมายได้สำเร็จตามเป้าหมายที่วางไว้', 'rating', 1, '2025-04-11 02:26:36', '2025-07-01 12:49:59'),
(23, 1, 6, NULL, 'ผู้บริหารมีวิธีการรับฟังความคิดเห็นที่หลากหลายและใช้ข้อมูลนั้นในการตัดสินใจได้อย่างรอบด้าน', 'rating', 1, '2025-04-11 02:26:55', '2025-07-01 12:50:04'),
(24, 1, 6, NULL, 'ผู้บริหารสนับสนุนการทำงานร่วมกันระหว่างหน่วยงานหรือทีมงานที่มีเป้าหมายร่วมกันได้อย่างเหมาะสม', 'rating', 1, '2025-04-11 02:27:09', '2025-07-01 12:50:08'),
(25, 1, 6, NULL, 'ผู้บริหารสามารถสร้างความไว้วางใจในทีมงานเพื่อเสริมสร้างความร่วมมือได้อย่างแข็งแกร่ง', 'rating', 1, '2025-04-11 02:27:24', '2025-07-01 12:50:12'),
(162, 4, 13, NULL, 'ผู้บริหารสามารถวางแผนกลยุทธ์และกำกับดูแลการดำเนินงานที่สอดคล้องกับเป้าหมายองค์กรได้ครอบคลุมทุกมิติ', 'rating', 1, '2025-04-20 21:15:38', '2025-07-01 13:09:03'),
(163, 4, 13, NULL, 'ผู้บริหารสามารถแสดงความเป็นผู้นำในการแก้ไขปัญหาเชิงซับซ้อนได้อย่างชัดเจน', 'rating', 1, '2025-04-20 21:15:52', '2025-07-01 13:09:07'),
(164, 4, 13, NULL, 'ผู้บริหารมีแนวทางในการสร้างความร่วมมือกับหน่วยงานภายนอกเพื่อส่งเสริมการทำงานที่บรรลุเป้าหมายได้อย่างสมบูรณ์', 'rating', 1, '2025-04-20 21:16:34', '2025-07-01 13:09:10'),
(165, 4, 14, NULL, 'ผู้บริหารมีวิธีการสนับสนุนการดำเนินงานที่คำนึงถึงผลกระทบด้านสิ่งแวดล้อมได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 21:17:03', '2025-07-01 13:09:25'),
(166, 4, 14, NULL, 'ผู้บริหารส่งเสริมการทำงานร่วมกันในระดับชุมชนและสร้างผลประโยชน์ทางเศรษฐกิจได้อย่างมีความเป็นธรรม', 'rating', 1, '2025-04-20 21:17:14', '2025-07-01 13:09:28'),
(167, 4, 14, NULL, 'ผู้บริหารมีแนวทางส่งเสริมความรับผิดชอบต่อสังคมขององค์กร (CSR) ได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 21:17:26', '2025-07-01 13:09:32'),
(168, 4, 15, NULL, 'ผู้บริหารสามารถสื่อสารกับหน่วยงานภายนอกเพื่อแก้ไขปัญหาและส่งเสริมความร่วมมือได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-04-20 21:17:46', '2025-07-01 13:09:37'),
(169, 4, 15, NULL, 'ผู้บริหารสามารถสร้างเครือข่ายความสัมพันธ์ที่เป็นประโยชน์ต่อองค์กรและชุมชนได้เข้มแข็ง', 'rating', 1, '2025-04-20 21:17:58', '2025-07-01 13:09:41'),
(170, 4, 15, NULL, 'ผู้บริหารใช้เทคโนโลยีเพื่อสื่อสารและสร้างความเข้าใจกับหน่วยงานภายนอกได้อย่างชัดเจน', 'rating', 1, '2025-04-20 21:18:25', '2025-07-01 13:09:45'),
(171, 4, 16, NULL, 'ผู้บริหารสามารถใช้ข้อมูลเชิงวิเคราะห์เพื่อสนับสนุนการตัดสินใจที่สำคัญได้ทันท่วงที', 'rating', 1, '2025-04-20 21:18:45', '2025-07-01 13:09:49'),
(172, 4, 16, NULL, 'ผู้บริหารส่งเสริมนวัตกรรมและการนำเทคโนโลยีมาใช้ในการพัฒนาองค์กรได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 21:20:14', '2025-07-01 13:09:53'),
(173, 4, 16, NULL, 'ผู้บริหารสามารถนำเสนอแนวคิดสร้างสรรค์เพื่อแก้ไขปัญหาและพัฒนาองค์กรได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 21:20:26', '2025-07-01 13:09:57'),
(174, 4, 17, NULL, 'ผู้บริหารมีแนวทางอย่างไรในการส่งเสริมธรรมาภิบาลและความโปร่งใสในงานที่รับผิดชอบ', 'rating', 1, '2025-04-20 21:20:44', '2025-07-01 13:10:02'),
(175, 4, 17, NULL, 'ผู้บริหารปฏิบัติงานโดยคำนึงถึงความยุติธรรมและจริยธรรม', 'rating', 1, '2025-04-20 21:20:55', '2025-07-01 13:10:06'),
(176, 4, 17, NULL, 'ผู้บริหารแสดงเป็นแบบอย่างที่ชัดเจนของการรักษาจรรยาบรรณในการทำงาน', 'rating', 1, '2025-04-20 21:21:06', '2025-07-01 13:10:10'),
(177, 4, 18, NULL, 'ผู้บริหารสามารถสร้างความสัมพันธ์ที่ดีและส่งเสริมการทำงานร่วมกันในทีมเพื่อบรรลุเป้าหมายได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 21:21:25', '2025-07-01 13:10:17'),
(178, 4, 18, NULL, 'ผู้บริหารมีวิธีการรับฟังความคิดเห็นที่หลากหลายและใช้ข้อมูลนั้นในการตัดสินใจได้อย่างชัดเจน', 'rating', 1, '2025-04-20 21:21:39', '2025-07-01 13:10:20'),
(179, 4, 18, NULL, 'ผู้บริหารสนับสนุนการทำงานร่วมกันระหว่างหน่วยงานหรือทีมงานที่มีเป้าหมายร่วมกันได้', 'rating', 1, '2025-04-20 21:21:51', '2025-07-01 13:10:24'),
(288, 7, 46, NULL, 'มีสามารถในการวิเคราะห์ปัญหาและตัดสินใจโดยใช้ข้อมูลที่น่าเชื่อถือเพื่อบรรลุเป้าหมายงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-04-20 23:30:44', '2025-07-01 13:40:07'),
(289, 7, 46, NULL, 'มีแนวทางการจัดการข้อมูลและการคิดเชิงระบบเพื่อแก้ไขปัญหาอย่างมีประสิทธิภาพ', 'rating', 1, '2025-04-20 23:30:56', '2025-07-01 13:40:12'),
(290, 7, 46, NULL, 'มีความสามารถในการนำเสนอแนวคิดใหม่ ๆ เพื่อพัฒนากระบวนการทำงานได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 23:31:08', '2025-07-01 13:40:15'),
(291, 7, 47, NULL, 'มีสามารถในการสร้างความสัมพันธ์และส่งเสริมการทำงานร่วมกันในทีมงานได้อย่างแข็งแกร่ง', 'rating', 1, '2025-04-20 23:31:25', '2025-07-01 13:40:20'),
(292, 7, 47, NULL, 'มีวิธีการจัดการความขัดแย้งในทีมงานหรือระหว่างหน่วยงานได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 23:31:38', '2025-07-01 13:40:24'),
(293, 7, 47, NULL, 'ร่วมส่งเสริมการพัฒนาศักยภาพของทีมและสร้างบรรยากาศการทำงานที่สนับสนุนความร่วมมือได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 23:31:50', '2025-07-01 13:40:27'),
(294, 7, 48, NULL, 'สามารถบริหารจัดการงานที่มีความซับซ้อนภายใต้ข้อจำกัดด้านทรัพยากรได้อย่างมีประสิทธิผล', 'rating', 1, '2025-04-20 23:32:06', '2025-07-01 13:40:32'),
(295, 7, 48, NULL, 'มีแนวทางในการใช้เทคโนโลยีเพื่อเพิ่มประสิทธิภาพและลดข้อผิดพลาดในงานได้อย่างทันท่วงที', 'rating', 1, '2025-04-20 23:32:17', '2025-07-01 13:40:35'),
(296, 7, 48, NULL, 'มีวิธีการใช้เทคโนโลยีเพื่อปรับปรุงกระบวนการทำงานและลดความผิดพลาดได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 23:33:06', '2025-07-01 13:40:38'),
(297, 7, 48, NULL, 'สามารถนำกฎหมายและข้อบังคับที่เกี่ยวข้องมาใช้ในการแก้ไขปัญหาในงานได้อย่างเหมาะสม', 'rating', 1, '2025-04-20 23:33:21', '2025-07-01 13:40:42'),
(298, 7, 49, NULL, 'มีส่วนช่วยในการลดผลกระทบต่อสิ่งแวดล้อมและสนับสนุนการดำเนินงานที่ยั่งยืนขององค์กรได้', 'rating', 1, '2025-04-20 23:33:35', '2025-07-01 13:40:48'),
(299, 7, 49, NULL, 'มีความสามารถในการพัฒนาแผนงานที่สอดคล้องกับเป้าหมายองค์กรและความยั่งยืนได้', 'rating', 1, '2025-04-20 23:33:48', '2025-07-01 13:40:51'),
(300, 7, 49, NULL, 'มีความสามารถในการเรียนรู้และนำนวัตกรรมมาใช้เพื่อสร้างความยั่งยืนในองค์กรได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-04-20 23:33:59', '2025-07-01 13:40:55'),
(441, 2, 10, NULL, 'บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-07 15:22:37', '2025-07-07 15:22:37'),
(442, 2, 10, NULL, 'บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-07 15:22:50', '2025-07-07 15:22:50'),
(443, 2, 10, NULL, 'บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-07 15:23:07', '2025-07-07 15:23:07'),
(444, 2, 10, NULL, 'บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-07 15:23:19', '2025-07-07 15:23:19'),
(445, 2, 10, NULL, 'บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-07 15:23:31', '2025-07-07 15:23:31'),
(446, 2, 10, NULL, 'บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-07 15:23:44', '2025-07-07 15:23:44'),
(447, 2, 10, NULL, 'บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-07 15:23:55', '2025-07-07 15:23:55'),
(448, 2, 10, NULL, 'บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-07 15:24:07', '2025-07-07 15:24:07'),
(449, 2, 58, NULL, 'บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-07 15:42:33', '2025-07-07 15:42:48'),
(450, 2, 58, NULL, 'บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-07 15:43:01', '2025-07-07 15:43:01'),
(451, 2, 58, NULL, 'บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-07 15:43:14', '2025-07-07 15:43:14'),
(452, 2, 58, NULL, 'บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-07 15:43:26', '2025-07-07 15:43:26'),
(453, 2, 58, NULL, 'บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-07 15:43:39', '2025-07-07 15:43:39'),
(454, 2, 58, NULL, 'บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-07 15:43:55', '2025-07-07 15:43:55'),
(455, 2, 58, NULL, 'บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-07 15:44:07', '2025-07-07 15:44:07'),
(456, 2, 58, NULL, 'บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-07 15:44:21', '2025-07-07 15:44:21'),
(460, 8, 53, NULL, 'บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-07 16:14:34', '2025-07-07 16:14:34'),
(461, 8, 53, NULL, 'บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-07 16:14:51', '2025-07-07 16:14:51'),
(462, 8, 53, NULL, 'บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-07 16:15:05', '2025-07-07 16:15:05'),
(463, 8, 53, NULL, 'บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-07 16:15:15', '2025-07-07 16:15:15'),
(464, 8, 53, NULL, 'บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-07 16:15:28', '2025-07-07 16:15:28'),
(465, 8, 53, NULL, 'บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-07 16:15:40', '2025-07-07 16:15:40'),
(466, 8, 53, NULL, 'บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-07 16:15:53', '2025-07-07 16:15:53'),
(467, 8, 53, NULL, 'บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-07 16:16:31', '2025-07-07 16:16:31'),
(468, 8, 59, NULL, 'บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-07 16:17:05', '2025-07-07 16:17:05'),
(469, 8, 59, NULL, 'บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-07 16:17:17', '2025-07-07 16:17:17'),
(470, 8, 59, NULL, 'บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-07 16:17:29', '2025-07-07 16:17:29'),
(471, 8, 59, NULL, 'บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-07 16:17:40', '2025-07-07 16:17:40'),
(472, 8, 59, NULL, 'บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-07 16:17:51', '2025-07-07 16:17:51'),
(473, 8, 59, NULL, 'บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-07 16:18:04', '2025-07-07 16:18:04'),
(474, 8, 59, NULL, 'บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-07 16:18:17', '2025-07-07 16:18:17'),
(475, 8, 59, NULL, 'บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-07 16:18:29', '2025-07-07 16:18:29'),
(476, 5, 60, NULL, '1.บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-09 19:52:39', '2025-07-09 19:52:39'),
(477, 5, 60, NULL, '2.บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-09 19:52:54', '2025-07-09 19:52:54'),
(478, 5, 60, NULL, '3.บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-09 19:53:07', '2025-07-09 19:53:07'),
(479, 5, 60, NULL, '4.บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-09 19:53:28', '2025-07-09 19:53:28'),
(480, 5, 60, NULL, '5.บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-09 19:53:40', '2025-07-09 19:53:40'),
(481, 5, 60, NULL, '6.บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-09 19:53:52', '2025-07-09 19:53:52'),
(482, 5, 60, NULL, '7.บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-09 19:54:05', '2025-07-09 19:54:05'),
(483, 5, 60, NULL, '8.บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 19:54:16', '2025-07-09 19:54:16'),
(484, 5, 61, NULL, '1.บุคลากรมีมุมมองเชิงกลยุทธ์ มองเห็นโอกาสทางธุรกิจ คิดเป็นระบบ และสามารถตัดสินใจโดยพิจารณาผลกระทบในหลายด้าน', 'rating', 1, '2025-07-09 19:54:35', '2025-07-09 19:54:35'),
(485, 5, 61, NULL, '2.บุคลากรสามารถคิดสร้างสรรค์ ริเริ่มสิ่งใหม่ ๆ และพัฒนานวัตกรรมหรือแนวทางใหม่ในการทำงาน', 'rating', 1, '2025-07-09 19:54:49', '2025-07-09 19:54:49'),
(486, 5, 61, NULL, '3.บุคลากรมีความสามารถในการใช้เทคโนโลยี วิเคราะห์ข้อมูล และนำข้อมูลมาปรับปรุงงานอย่างต่อเนื่อง', 'rating', 1, '2025-07-09 19:55:00', '2025-07-09 19:55:00'),
(487, 5, 61, NULL, '4.บุคลากรมีความสามารถในการปรับตัว ฟื้นตัวจากความผิดพลาด และเปิดใจรับฟังความคิดเห็นที่แตกต่าง', 'rating', 1, '2025-07-09 19:55:11', '2025-07-09 19:55:11'),
(488, 5, 61, NULL, '5.บุคลากรสามารถสร้างความสัมพันธ์ที่ดี ทำงานร่วมกับผู้อื่น และสื่อสารประสานงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-09 19:55:24', '2025-07-09 19:55:24'),
(489, 5, 61, NULL, '6.บุคลากรมีความรับผิดชอบ ปฏิบัติงานตามมาตรฐานอย่างถูกต้องแม่นยำ และสามารถรายงานผลได้อย่างมืออาชีพ', 'rating', 1, '2025-07-09 19:55:38', '2025-07-09 19:55:38'),
(490, 5, 61, NULL, '7.บุคลากรยึดมั่นในหลักจริยธรรม มีความโปร่งใส และคำนึงถึงผลกระทบของงานต่อองค์กรและสังคม', 'rating', 1, '2025-07-09 19:55:54', '2025-07-09 19:55:54'),
(491, 5, 61, NULL, '8.บุคลากรมีความตระหนักรู้เกี่ยวกับความเสี่ยง และสามารถจัดการความเสี่ยงในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 19:56:09', '2025-07-09 19:56:09'),
(515, 10, 91, NULL, 'ผู้บริหารสามารถจัดทำแผนงานที่สอดคล้องกับวิสัยทัศน์และเป้าหมายองค์กรได้', 'rating', 1, '2025-07-09 20:30:06', '2025-07-09 20:30:06'),
(516, 10, 91, NULL, 'ผู้บริหารสามารถกำหนดกลยุทธ์และนำไปปฏิบัติในสถานการณ์ที่เปลี่ยนแปลงได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:30:18', '2025-07-09 20:30:18'),
(517, 10, 91, NULL, 'ผู้บริหารสนับสนุนให้ทีมทำงานด้วยความทุ่มเทและมุ่งมั่นในการบรรลุเป้าหมายองค์กร', 'rating', 1, '2025-07-09 20:30:30', '2025-07-09 20:30:30'),
(518, 10, 91, NULL, 'ผู้บริหารแสดงให้เห็นถึงความสามารถในการแก้ไขปัญหาภายใต้สถานการณ์ที่มีข้อจำกัด', 'rating', 1, '2025-07-09 20:30:42', '2025-07-09 20:30:42'),
(519, 10, 92, NULL, 'ผู้บริหารสามารถออกแบบระบบหรือขั้นตอนการปฏิบัติงานที่เพิ่มประสิทธิภาพการทำงานของทีมได้อย่างแข็งแกร่ง', 'rating', 1, '2025-07-09 20:31:05', '2025-07-09 20:31:05'),
(520, 10, 92, NULL, 'ผู้บริหารส่งเสริมการทำงานที่คำนึงถึงผลกระทบต่อด้านสิ่งแวดล้อมอย่างการปรับปรุงระบบการจัดการของเสียในนิคมฯ ด้านสังคมอย่างการฝึกอบรมทักษะให้กับชุมชนรอบนิคมฯ และด้านเศรษฐกิจอย่างการวางแผนเพิ่มประสิทธิภาพการใช้พลังงานในกระบวนการผลิต เป็นต้น', 'rating', 1, '2025-07-09 20:31:23', '2025-07-09 20:31:23'),
(521, 10, 92, NULL, 'ผู้บริหารมีแนวทางการกำกับดูแลการทำงานที่ส่งเสริมความยั่งยืนในองค์กรที่ชัดเจนและเหมาะสม', 'rating', 1, '2025-07-09 20:31:37', '2025-07-09 20:31:37'),
(522, 10, 93, NULL, 'ผู้บริหารมีวิธีการบริหารจัดการสื่อสารในสถานการณ์วิกฤตเพื่อสร้างความมั่นใจในองค์กร', 'rating', 1, '2025-07-09 20:31:57', '2025-07-09 20:31:57'),
(523, 10, 93, NULL, 'ผู้บริหารสามารถใช้วิธีการสื่อสารที่เหมาะสมเพื่อสร้างความเข้าใจในกลุ่มผู้ร่วมงานที่มีความหลากหลายได้อย่างชัดเจนและเหมาะสม', 'rating', 1, '2025-07-09 20:32:11', '2025-07-09 20:32:11'),
(524, 10, 93, NULL, 'ผู้บริหารสามารถสื่อสารเชิงรุกเพื่อสนับสนุนการแก้ไขปัญหาหรือข้อขัดแย้งในทีมได้อย่างทันเวลา', 'rating', 1, '2025-07-09 20:32:23', '2025-07-09 20:32:23'),
(525, 10, 93, NULL, 'ผู้บริหารใช้ช่องทางดิจิทัลหรือสื่อออนไลน์เพื่อสร้างความเชื่อมโยงกับผู้ที่เกี่ยวข้องได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:32:36', '2025-07-09 20:32:36'),
(526, 10, 94, NULL, 'ผู้บริหารมีแนวทางในการสร้างแรงจูงใจและพัฒนาทีมงานเพื่อบรรลุเป้าหมายองค์กรได้อย่างชัดเจน', 'rating', 1, '2025-07-09 20:32:56', '2025-07-09 20:32:56'),
(527, 10, 94, NULL, 'ผู้บริหารสนับสนุนให้ทีมเรียนรู้และทดลองนวัตกรรมใหม่ ๆ เพื่อปรับปรุงกระบวนการทำงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:33:10', '2025-07-09 20:33:10'),
(528, 10, 94, NULL, 'ผู้บริหารสามารถนำข้อมูลเชิงวิเคราะห์มาใช้ในการตัดสินใจที่สำคัญขององค์กรได้เหมาะสม', 'rating', 1, '2025-07-09 20:33:23', '2025-07-09 20:33:23'),
(529, 10, 94, NULL, 'ผู้บริหารมีแนวทางในการนำเทคโนโลยีดิจิทัลมาใช้เพื่อพัฒนาการบริการและกระบวนการทำงานได้อย่างทันสมัย', 'rating', 1, '2025-07-09 20:33:35', '2025-07-09 20:33:35'),
(530, 10, 95, NULL, 'ผู้บริหารมีวิธีการกำกับดูแลให้บุคลากรปฏิบัติงานด้วยความซื่อสัตย์และโปร่งใสโดยไม่เลือกปฏิบัติ', 'rating', 1, '2025-07-09 20:33:54', '2025-07-09 20:33:54'),
(531, 10, 95, NULL, 'ผู้บริหารส่งเสริมการเคารพในความแตกต่างของผู้มีส่วนได้ส่วนเสียทั้งภายในและภายนอกองค์กร', 'rating', 1, '2025-07-09 20:34:07', '2025-07-09 20:34:07'),
(532, 10, 95, NULL, 'ผู้บริหารมีแนวทางในการสร้างวัฒนธรรมองค์กรที่เน้นความยุติธรรมและธรรมาภิบาล', 'rating', 1, '2025-07-09 20:34:20', '2025-07-09 20:34:20'),
(533, 10, 95, NULL, 'ผู้บริหารเป็นแบบอย่างของการปฏิบัติงานที่คำนึงถึงจริยธรรมและความถูกต้องในการทำงาน', 'rating', 1, '2025-07-09 20:34:35', '2025-07-09 20:34:35'),
(534, 10, 96, NULL, 'ผู้บริหารสามารถสร้างความสัมพันธ์ที่ดีและส่งเสริมการทำงานร่วมกันในทีมเพื่อบรรลุเป้าหมายได้สำเร็จตามเป้าหมายที่วางไว้', 'rating', 1, '2025-07-09 20:35:20', '2025-07-09 20:35:20'),
(535, 10, 96, NULL, 'ผู้บริหารมีวิธีการรับฟังความคิดเห็นที่หลากหลายและใช้ข้อมูลนั้นในการตัดสินใจได้อย่างรอบด้าน', 'rating', 1, '2025-07-09 20:35:31', '2025-07-09 20:35:31'),
(536, 10, 96, NULL, 'ผู้บริหารสนับสนุนการทำงานร่วมกันระหว่างหน่วยงานหรือทีมงานที่มีเป้าหมายร่วมกันได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:35:43', '2025-07-09 20:35:43'),
(537, 10, 96, NULL, 'ผู้บริหารสามารถสร้างความไว้วางใจในทีมงานเพื่อเสริมสร้างความร่วมมือได้อย่างแข็งแกร่ง', 'rating', 1, '2025-07-09 20:35:58', '2025-07-09 20:35:58'),
(538, 11, 66, NULL, 'ค่านิยมใหม่\" ของ กนอ. ที่ได้เริ่มมีการใช้มาตั้งแต่ ปีงบประมาณ 2567 (ภาษาไทย) คือ', 'choice', 1, '2025-07-09 20:36:49', '2025-08-07 08:45:09'),
(539, 11, 66, NULL, 'ค่านิยมใหม่\" ของ กนอ. ที่ได้เริ่มมีการใช้มาตั้งแต่ ปีงบประมาณ 2567 (ภาษาอังกฤษ)  คือ', 'choice', 1, '2025-07-09 20:37:08', '2025-08-07 08:45:15'),
(540, 11, 66, NULL, 'ท่านรับรู้ข้อมูลค่านิยม กนอ. จากใคร (เลือกได้มากกว่า 1 ข้อ)', 'multiple_choice', 1, '2025-07-09 20:37:57', '2025-07-09 20:37:57'),
(541, 11, 66, NULL, 'ท่านรับรู้ข้อมูลค่านิยมของ กนอ. จากช่องทางใดบ้าง (เลือกได้มากกว่า 1 ข้อ)', 'multiple_choice', 1, '2025-07-09 20:38:32', '2025-07-09 20:38:32'),
(542, 11, 67, NULL, 'ข้อใดแสดงความหมายของ I-EA-T ได้ถูกต้องที่สุด', 'choice', 1, '2025-07-09 20:39:16', '2025-07-09 20:39:16'),
(543, 11, 67, NULL, 'ข้อความใดต่อไปนี้เป็นค่านิยมของ กนอ. ในภาษาไทย', 'choice', 1, '2025-07-09 20:39:38', '2025-07-09 20:39:38'),
(544, 11, 68, NULL, 'ข้อใด ไม่ใช่ พฤติกรรมพึงประสงค์ ภายใต้ค่านิยม “เก่งคิด – IQ”', 'choice', 1, '2025-07-09 20:40:10', '2025-07-09 20:40:10'),
(545, 11, 68, NULL, 'ข้อใด ไม่ใช่ พฤติกรรมพึงประสงค์ ภายใต้ค่านิยม “เก่งงาน – TQ (Technology Quotient)”', 'choice', 1, '2025-07-09 20:40:34', '2025-07-09 20:40:34'),
(550, 12, 90, NULL, 'จงยกตัวอย่างพฤติกรรมที่พึ่งประสงค์ของค่านิยมหัวข้อ \"เก่งงาน AQ (Adversity Quotient) ซึ่งสะท้อน ความเป็นมืออาชีพในการทำงาน (Professional) มาสั้น ๆ เพื่อเป็นตัวอย่าง', 'open_text', 1, '2025-07-09 20:44:23', '2025-07-29 14:43:48'),
(554, 63, 82, NULL, 'มีสามารถในการวิเคราะห์ปัญหาและตัดสินใจโดยใช้ข้อมูลที่น่าเชื่อถือเพื่อบรรลุเป้าหมายงานได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-09 20:50:19', '2025-07-09 20:50:19'),
(555, 63, 82, NULL, 'มีแนวทางการจัดการข้อมูลและการคิดเชิงระบบเพื่อแก้ไขปัญหาอย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-09 20:50:36', '2025-07-09 20:50:36'),
(556, 63, 82, NULL, 'มีความสามารถในการนำเสนอแนวคิดใหม่ ๆ เพื่อพัฒนากระบวนการทำงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:51:07', '2025-07-09 20:51:07'),
(557, 63, 84, NULL, 'มีสามารถในการสร้างความสัมพันธ์และส่งเสริมการทำงานร่วมกันในทีมงานได้อย่างแข็งแกร่ง', 'rating', 1, '2025-07-09 20:53:21', '2025-07-09 20:53:21'),
(558, 63, 84, NULL, 'มีวิธีการจัดการความขัดแย้งในทีมงานหรือระหว่างหน่วยงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:53:37', '2025-07-09 20:53:37'),
(559, 63, 84, NULL, 'ร่วมส่งเสริมการพัฒนาศักยภาพของทีมและสร้างบรรยากาศการทำงานที่สนับสนุนความร่วมมือได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:53:48', '2025-07-09 20:53:48'),
(560, 63, 85, NULL, 'สามารถบริหารจัดการงานที่มีความซับซ้อนภายใต้ข้อจำกัดด้านทรัพยากรได้อย่างมีประสิทธิผล', 'rating', 1, '2025-07-09 20:54:12', '2025-07-09 20:54:12'),
(561, 63, 85, NULL, 'มีแนวทางในการใช้เทคโนโลยีเพื่อเพิ่มประสิทธิภาพและลดข้อผิดพลาดในงานได้อย่างทันท่วงที', 'rating', 1, '2025-07-09 20:54:22', '2025-07-09 20:54:22'),
(562, 63, 85, NULL, 'มีวิธีการใช้เทคโนโลยีเพื่อปรับปรุงกระบวนการทำงานและลดความผิดพลาดได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:54:34', '2025-07-09 20:54:34'),
(563, 63, 85, NULL, 'สามารถนำกฎหมายและข้อบังคับที่เกี่ยวข้องมาใช้ในการแก้ไขปัญหาในงานได้อย่างเหมาะสม', 'rating', 1, '2025-07-09 20:54:45', '2025-07-09 20:54:45'),
(564, 63, 86, NULL, 'มีส่วนช่วยในการลดผลกระทบต่อสิ่งแวดล้อมและสนับสนุนการดำเนินงานที่ยั่งยืนขององค์กรได้', 'rating', 1, '2025-07-09 20:55:17', '2025-07-09 20:55:17'),
(565, 63, 86, NULL, 'มีความสามารถในการพัฒนาแผนงานที่สอดคล้องกับเป้าหมายองค์กรและความยั่งยืนได้', 'rating', 1, '2025-07-09 20:55:30', '2025-07-09 20:55:30'),
(566, 63, 86, NULL, 'มีความสามารถในการเรียนรู้และนำนวัตกรรมมาใช้เพื่อสร้างความยั่งยืนในองค์กรได้อย่างมีประสิทธิภาพ', 'rating', 1, '2025-07-09 20:56:33', '2025-07-09 20:56:33'),
(567, 64, 77, NULL, 'ค่านิยมใหม่\" ของ กนอ. ที่มีการปรับปรุงและจะนำมาใช้ในปีงบปีประมาณ 2567 (ภาษาไทย) คือ', 'choice', 1, '2025-07-09 20:58:55', '2025-07-09 21:00:12'),
(568, 64, 77, NULL, 'ค่านิยมใหม่\" ของ กนอ. ที่มีการปรับปรุงและจะนำมาใช้ในปีงบปีประมาณ 2567 (ภาษาอังกฤษ)  คือ', 'choice', 1, '2025-07-09 20:59:13', '2025-07-09 21:00:29'),
(569, 64, 77, NULL, 'ท่านรับรู้ข้อมูลค่านิยม กนอ. จากใคร (เลือกได้มากกว่า 1 ข้อ', 'multiple_choice', 1, '2025-07-09 21:00:57', '2025-07-09 21:00:57'),
(570, 64, 77, NULL, 'ท่านรับรู้ข้อมูลค่านิยมของ กนอ. จากช่องทางใดบ้าง (เลือกได้มากกว่า 1 ข้อ)', 'multiple_choice', 1, '2025-07-09 21:01:25', '2025-07-09 21:01:25'),
(571, 64, 78, NULL, 'ข้อใดแสดงความหมายของ I-EA-T ได้ถูกต้องที่สุด', 'choice', 1, '2025-07-09 21:03:08', '2025-07-09 21:03:08'),
(572, 64, 78, NULL, 'ข้อความใดต่อไปนี้เป็นค่านิยมของ กนอ. ในภาษาไทย', 'choice', 1, '2025-07-09 21:03:31', '2025-07-09 21:03:31'),
(573, 64, 79, NULL, 'ข้อใด ไม่ใช่ พฤติกรรมพึงประสงค์ ภายใต้ค่านิยม “เก่งคิด – IQ”', 'choice', 1, '2025-07-09 21:04:32', '2025-07-09 21:04:32'),
(574, 64, 79, NULL, 'ข้อใด ไม่ใช่ พฤติกรรมพึงประสงค์ ภายใต้ค่านิยม “เก่งงาน – TQ (Technology Quotient)”', 'choice', 1, '2025-07-09 21:04:55', '2025-07-09 21:04:55'),
(579, 65, 72, NULL, 'จงยกตัวอย่างพฤติกรรมที่พึ่งประสงค์ของค่านิยมหัวข้อ \"เก่งงาน AQ (Adversity Quotient) ซึ่งสะท้อน ความเป็นมืออาชีพในการทำงาน (Professional) มาสั้น ๆ เพื่อเป็นตัวอย่าง', 'open_text', 1, '2025-07-09 21:07:13', '2025-07-29 14:44:19');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `questions_part_id_foreign` (`part_id`),
  ADD KEY `questions_aspect_id_foreign` (`aspect_id`),
  ADD KEY `questions_sub_aspect_id_foreign` (`sub_aspect_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=582;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `questions`
--
ALTER TABLE `questions`
  ADD CONSTRAINT `questions_aspect_id_foreign` FOREIGN KEY (`aspect_id`) REFERENCES `aspects` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `questions_part_id_foreign` FOREIGN KEY (`part_id`) REFERENCES `parts` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `questions_sub_aspect_id_foreign` FOREIGN KEY (`sub_aspect_id`) REFERENCES `sub_aspects` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
